OdGsDCRectDouble.m_max
Maximum point.

OdGsDCRectDouble.m_min
Minimum point.

OdGsDCRectDouble.round
\remarks
Rounds coordinate values of the minimum and maximum points.

OdGsDCRectDouble.op_Inequality(OdGsDCRectDouble!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\remarks
Inequality operator for the OdGsDCRect class.
Rectangles are considered not equal if at least one of the following conditions fails:
* the minimum point of this rectangle equals to the minimum point of the passed rectangle
* the maximum point of this rectangle equals to the maximum point of the passed rectangle
\param dcRect [in]  2D rectangle to compare.

OdGsDCRectDouble.op_Equality(OdGsDCRectDouble!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\remarks
Equality operator for the OdGsDCRectDouble class.
Rectangles are considered equal if:
* the minimum point of this rectangle equals to the minimum point of the passed rectangle
* the maximum point of this rectangle equals to the maximum point of the passed rectangle
\param dcPoint [in]  2D rectangle to compare.

OdGsDCRectDouble.op_Assign(OdGsDCRect!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Assignment operator for the OdGsDCRectDouble class. Assigns the passed rectangle.
\param dcRect [in]  Rectangle to assign.

OdGsDCRectDouble.#ctor(OdGsDCRect!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Constructor for the OdGsDCRectDouble class. Creates an instance base on the passed rectangle.
\param rc [in]  Rectangle to copy.

OdGsDCRectDouble.#ctor(System.Double,System.Double,System.Double,System.Double)
\details
Constructor for the OdGsDCRectDouble class.
\param xMin [in]  Minimum X-coordinate.
\param xMax [in]  Maximum X-coordinate.
\param yMin [in]  Minimum Y-coordinate.
\param yMax [in]  Maximum Y-coordinate.

OdGsDCRectDouble.#ctor(OdGePoint2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePoint2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Constructor for the OdGsDCRectDouble class.
\param minPoint [in]  Lower-left corner.
\param maxPoint [in]  Upper-right corner.

OdGsDCRectDouble.#ctor
\details
Default constructor for the OdGsDCRectDouble class.